//侧边栏
module.exports = {
    '/': [
        {
            title: '学习须知',
            collapsable: false,
            children: [
                '0.0.学习须知/01',
                '0.0.学习须知/02',
                '0.0.学习须知/03',
            ]
        },
        {
            title: '指导学习',
            collapsable: false,
            children: [
                '0.01.指导学习/021',
                '0.01.指导学习/022',
                '0.01.指导学习/023',
            ]
        },
        {
            title: '数组系列',
            collapsable: false,
            children: [
                '1.0.数组系列/001',
                '1.0.数组系列/002',
                '1.0.数组系列/003',
                '1.0.数组系列/004',
                '1.0.数组系列/005',
                '1.0.数组系列/006',
                '1.0.数组系列/007',
                '1.0.数组系列/008',
                '1.0.数组系列/009',
            ]
        },
        {
            title: '链表系列',
            collapsable: false,
            children: [
                '1.1.链表系列/101',
                '1.1.链表系列/102',
                '1.1.链表系列/103',
                '1.1.链表系列/104',
            ]
        },
        {
            title: '动态规划',
            collapsable: false,
            children: [
                '1.2.动态规划系列/201',
                '1.2.动态规划系列/202',
                '1.2.动态规划系列/203',
                '1.2.动态规划系列/204',
                '1.2.动态规划系列/205',
                '1.2.动态规划系列/206',
            ]
        },
        {
            title: '字符串系列',
            collapsable: false,
            children: [
                '1.3.字符串系列/301',
                '1.3.字符串系列/302',
                '1.3.字符串系列/303',
                '1.3.字符串系列/304',
                '1.3.字符串系列/305',
                '1.3.字符串系列/306',
                '1.3.字符串系列/307',
                '1.3.字符串系列/308'
            ]
        },
        {
            title: '二叉树系列',
            collapsable: false,
            children: [
                '1.4.二叉树系列/401',
                '1.4.二叉树系列/402',
                '1.4.二叉树系列/403',
                '1.4.二叉树系列/404',
                '1.4.二叉树系列/405',
                '1.4.二叉树系列/406',
                '1.4.二叉树系列/407',
                '1.4.二叉树系列/408'
            ]
        },
        {
            title: '回溯系列',
            collapsable: false,
            children: [
                '1.41.回溯系列/1',
            ]
        },
        {
            title: '滑动窗口系列',
            collapsable: false,
            children: [
                '1.5.滑动窗口系列/501',
                '1.5.滑动窗口系列/502',
                '1.5.滑动窗口系列/503',
                '1.5.滑动窗口系列/504',
            ]
        },
        {
            title: '博弈论问题',
            collapsable: false,
            children: [
                '1.6.博弈论系列/601',
                '1.6.博弈论系列/602',
                '1.6.博弈论系列/603',
                '1.6.博弈论系列/604',
                '1.6.博弈论系列/605',
                '1.6.博弈论系列/606',
                '1.6.博弈论系列/607',
                '1.6.博弈论系列/608',
                '1.6.博弈论系列/609',
                '1.6.博弈论系列/610',
            ]
        },
        {
            title: '位运算系列',
            collapsable: false,
            children: [
                '1.8.位运算系列/801',
                '1.8.位运算系列/802',
                '1.8.位运算系列/803',
                '1.8.位运算系列/804',
                '1.8.位运算系列/805',
                '1.8.位运算系列/806',
            ]
        },
        {
            title: '二分法系列',
            collapsable: false,
            children: [
                '1.9.二分法系列/901',
                '1.9.二分法系列/902',
                '1.9.二分法系列/903',
                '1.9.二分法系列/904',
                '1.9.二分法系列/905',
                '1.9.二分法系列/906',
            ]
        },
        {
            title: '其他题目',
            collapsable: false,
            children: [
                '1.99.其他补充题目/01',
                '1.99.其他补充题目/02',
                '1.99.其他补充题目/03',
                '1.99.其他补充题目/04',
                '1.99.其他补充题目/05',
                '1.99.其他补充题目/06',
                '1.99.其他补充题目/07',
                '1.99.其他补充题目/08',
                '1.99.其他补充题目/09',
                '1.99.其他补充题目/10',
                '1.99.其他补充题目/11',
                '1.99.其他补充题目/12',
                '1.99.其他补充题目/13',
                '1.99.其他补充题目/14',
                '1.99.其他补充题目/15',
                '1.99.其他补充题目/16',
                '1.99.其他补充题目/17',
                '1.99.其他补充题目/18',
                '1.99.其他补充题目/19',
                '1.99.其他补充题目/20',
                '1.99.其他补充题目/21',
                '1.99.其他补充题目/22',
                '1.99.其他补充题目/23',
                '1.99.其他补充题目/25',
                '1.99.其他补充题目/26',
                '1.99.其他补充题目/27',
                '1.99.其他补充题目/28',
                '1.99.其他补充题目/29',
                '1.99.其他补充题目/30',
                '1.99.其他补充题目/31',
                '1.99.其他补充题目/32',
                '1.99.其他补充题目/33',
                '1.99.其他补充题目/34',
                '1.99.其他补充题目/50',
                '1.99.其他补充题目/51',
                '1.99.其他补充题目/52',
            ]
        },
    ],
}